Documents/ЗаказНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказНаДоставку</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.ОтгрузкаТоваровКлиенту</xr:Item>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Доставка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки25</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставкиОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставкиПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаДоПеревозчика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставкиПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставкиПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияПеревозкиОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>В базовых ЕИ</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаДоставку25</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиДоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыДоставки25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДоставки25</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашимиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашКурьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НаправленияДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НаправленияДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкладПартнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исходящая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Входящая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаДоставку/Forms/ФормаДокумента/Ext/Form/Module.bsl
// @strict-types

#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; // см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Параметры.Ключ.Пустая();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриСозданииЧтенииНаСервере();
		
	КонецЕсли;
	
	ЭлементыДляЗаполненияВремени = Новый Массив; // Массив из ПолеФормы
	ЭлементыДляЗаполненияВремени.Добавить(Элементы.ВремяДоставкиС);
	ЭлементыДляЗаполненияВремени.Добавить(Элементы.ВремяДоставкиПо);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(ЭлементыДляЗаполненияВремени);
	
	УстановитьУсловноеОформление();
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриСозданииЧтенииНаСервере();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьДоступностьКомандыПодбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЭтоНовый = Ложь;
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	УстановитьДоступностьКомандыПодбора();
	ОбновитьИтоги(Объект.Товары, ВесИтог, ВесНеттоИтог, ОбъемИтог);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Номенклатура"
	 ИЛИ ИмяСобытия = "Запись_УпаковкиНоменклатуры" Тогда
		
		ПересчитатьСтрокиТоваров(ИмяСобытия, Источник);
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	
	РаботаСФайламиКлиент.ПоказатьПодтверждениеЗакрытияФормыСФайлами(ЭтотОбъект, Отказ, ЗавершениеРаботы, Объект.Ссылка);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

// Параметры:
//  ВыбранноеЗначение - Структура, Произвольный -
//  ИсточникВыбора - ФормаКлиентскогоПриложения -
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументДоставки.Форма.ФормаПодбора" Тогда
		
		Модифицированность = Истина;
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		РассчитатьИтогиВесОбъем();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	
	СпособДоставкиПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтправительПриИзменении(Элемент)
	
	ОтправительИзменен = (Объект.Отправитель <> ТекущийОтправитель);
	
	Если ОтправительИзменен
	   И Объект.Товары.Количество() > 0 Тогда
		
		Ответ = Ждать ПоказатьВопросОбОчисткеСпискаТоваров(); // КодВозвратаДиалога
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			
			ЗаполнитьЗначенияСвойств(Объект, ТекущиеДанныеОтправителя);
			ОтправительИзменен = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОтправительИзменен Тогда
		
		Объект.Товары.Очистить();
		ОтправительПриИзмененииСервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПолучательПриИзменении(Элемент)
	
	ПолучательИзменен = (Объект.Получатель <> ТекущийПолучатель);
	
	Если ПолучательИзменен
	   И Объект.Товары.Количество() > 0 Тогда
		
		Ответ = Ждать ПоказатьВопросОбОчисткеСпискаТоваров(); // КодВозвратаДиалога
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			
			ЗаполнитьЗначенияСвойств(Объект, ТекущиеДанныеПолучателя);
			ПолучательИзменен = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПолучательИзменен Тогда
		
		Объект.Товары.Очистить();
		ПолучательПриИзмененииСервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	
	ПеревозчикПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкаДоставкиПеревозчикаПриИзменении(Элемент)
	
	Если Объект.ДоставкаДоПеревозчика Тогда
		
		Если Объект.ТочкаДоставкиПеревозчика.Пустая() Тогда
			
			Объект.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
			
		Иначе
			
			ЗаполнитьЗонуДоставкиПоПеревозчику();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыеУсловияПеревозкиПриИзменении(Элемент)
	
	Элементы.ОсобыеУсловияПеревозкиОписание.ТолькоПросмотр = НЕ Объект.ОсобыеУсловияПеревозки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаДоПеревозчикаПриИзменении(Элемент)
	
	Если НЕ Объект.ДоставкаДоПеревозчика Тогда
		
		Объект.Перевозчик = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		ТекущийПеревозчик = Объект.Перевозчик;
		Объект.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
		Объект.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	КонецЕсли;
	
	НастроитьВидимостьДоступностьПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкаДоставкиПолучателяПриИзменении(Элемент)

	ТочкаДоставкиПолучателяПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкаДоставкиОтправителяПриИзменении(Элемент)
	
	ТочкаДоставкиОтправителяПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияИзменена = (Объект.Организация <> ТекущаяОрганизация);
	
	Если ОрганизацияИзменена
	   И Объект.Товары.Количество() > 0 Тогда
		
		Ответ = Ждать ПоказатьВопросОбОчисткеСпискаТоваров(); // КодВозвратаДиалога
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			
			Объект.Организация = ТекущаяОрганизация;
			ОрганизацияИзменена = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОрганизацияИзменена Тогда
		
		Объект.Товары.Очистить();
		ТекущаяОрганизация = Объект.Организация;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗонаОтправленияПриИзменении(Элемент)
	
	ТекущиеДанныеОтправителя = ДанныеОтправителя(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗонаДоставкиПриИзменении(Элемент)
	
	ТекущиеДанныеПолучателя = ДанныеПолучателя(Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Неопределено);
	ДобавитьДействияЗаполненияВесаОбъема(СтруктураДействий);
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Неопределено);
	
	НоменклатураПриИзмененииПереопределяемый = Новый Структура;
	НоменклатураПриИзмененииПереопределяемый.Вставить("ИмяФормы", ИмяФормы);
	НоменклатураПриИзмененииПереопределяемый.Вставить("ИмяТабличнойЧасти", "Товары");
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", НоменклатураПриИзмененииПереопределяемый);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ЗаполнитьВесНеттоЕдиницы(ТекущаяСтрока);
	ПересчитатьВесОбъемВОбщихЕдиницах(ТекущаяСтрока);
	РассчитатьИтогиВесОбъем();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Неопределено);
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Неопределено);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ПересчитатьВесОбъемВОбщихЕдиницах(ТекущаяСтрока);
	РассчитатьИтогиВесОбъем();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	ДобавитьДействияЗаполненияВесаОбъема(СтруктураДействий);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Неопределено);
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Неопределено);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ЗаполнитьВесНеттоЕдиницы(ТекущаяСтрока);
	ПересчитатьВесОбъемВОбщихЕдиницах(ТекущаяСтрока);
	РассчитатьИтогиВесОбъем();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Товары, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Товары, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	РассчитатьИтогиВесОбъем();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Параметры:
//   Команда - КомандаФормы - выполняемая команда
//
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.РаботаСФайлами

&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом

// Параметры:
//   Команда - КомандаФормы - выполняемая команда
//
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаленияДокумента(Команда)
	
	ОбщегоНазначенияУТКлиент.УстановитьПометкуУдаленияДокумента(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПодобратьДанные(Команда)
	
	ОчиститьСообщения();
	Отказ = Ложь;
	
	ПроверитьЗаполнениеПередПодбором(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность
	 ИЛИ ЭтоНовый Тогда
		
		РезультатЗаписи = Ждать РезультатЗаписиДокументаПередПодбором();
		
		Если НЕ РезультатЗаписи Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ЗаказНаДоставку.ФормаДокумента.Команда.ПодобратьДанные");
		ОткрытьПодборДанных();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	УстановитьУсловноеОформлениеНезаполненныйВесУпаковки();
	УстановитьУсловноеОформлениеНезаполненныйОбъемУпаковки();
	УстановитьУсловноеОформлениеНезаполненныйВесНетто();
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект);
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтотОбъект);
	УстановитьУсловноеОформлениеСерий();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНезаполненныйВесНетто()
	
	ТекстНеИспользуется = ДоставкаТоваровКлиентСервер.ТекстУсловногоОформленияНеИспользуетсяВесОбъем();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыВесНетто.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВесНеттоЕдиницы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ТекстНеИспользуется);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНезаполненныйОбъемУпаковки()
	
	ТекстНеИспользуется = ДоставкаТоваровКлиентСервер.ТекстУсловногоОформленияНеИспользуетсяВесОбъем();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыОбъем.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ОбъемУпаковки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ТекстНеИспользуется);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНезаполненныйВесУпаковки()
	
	ТекстНеИспользуется = ДоставкаТоваровКлиентСервер.ТекстУсловногоОформленияНеИспользуетсяВесОбъем();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыВесБрутто.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВесУпаковки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ТекстНеИспользуется);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСерий()
	
	СписокТиповДляСерий = Новый СписокЗначений; // СписокЗначений из ПеречислениеСсылка.ТипыНоменклатуры
	СписокТиповДляСерий.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	СписокТиповДляСерий.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	
	ПутьКПолюСерии = "Объект.Товары.Серия";
	ПутьКПолюОтбораТипНоменклатуры = "Объект.Товары.ТипНоменклатуры";
	ИмяПоляФормыСерии = Элементы.ТоварыСерия.Имя; // ПолеФормы
	
	// Для товаров
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляФормыСерии);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбораТипНоменклатуры);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокТиповДляСерий;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<для товаров>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Серия не указывается
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляФормыСерии);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюСерии);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбораТипНоменклатуры);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокТиповДляСерий;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<серия не указывается>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ТекущийОтправитель = Объект.Отправитель;
	ТекущийПолучатель = Объект.Получатель;
	ТекущийПеревозчик = Объект.Перевозчик;
	ТекущаяОрганизация = Объект.Организация;
	
	ТекущиеДанныеОтправителя = ДанныеОтправителя(Объект);
	ТекущиеДанныеПолучателя = ДанныеПолучателя(Объект);
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
	РаботаСТабличнымиЧастями.ИнициализироватьКэшСтрок(Элементы.Товары);
	
	НастроитьВидимостьДоступностьПолей();
	ОбновитьИтоги(Объект.Товары, ВесИтог, ВесНеттоИтог, ОбъемИтог);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыПоНоменклатуре()
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить(
		"ЗаполнитьПризнакХарактеристикиИспользуются",
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействий.Вставить(
		"ЗаполнитьПризнакТипНоменклатуры",
		Новый Структура("Номенклатура", "ТипНоменклатуры"));
	
	ДобавитьДействияЗаполненияВесаОбъема(СтруктураДействий);
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, СтруктураДействий);
	
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		
		ЗаполнитьВесНеттоЕдиницы(СтрокаТоваров);
		ПересчитатьВесОбъемВОбщихЕдиницах(СтрокаТоваров);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьДоступностьПолей()
	
	ИменаВидимыхЭлементов = Новый Массив; // Массив из Строка
	ИменаВсехЭлементов = Новый Массив; // Массив из Строка
	ИменаЭлементовВозможнойОбязательности = Новый Массив; // Массив из Строка
	ИменаОбязательныхЭлементов = Новый Массив; // Массив из Строка
	
	ИменаВсехЭлементов.Добавить(Элементы.ТочкаДоставкиОтправителя.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ЗонаОтправления.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТочкаДоставкиПолучателя.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ЗонаДоставки.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ВремяДоставкиС.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ВремяДоставкиПо.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ДополнительнаяИнформация.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ОсобыеУсловияПеревозки.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ОсобыеУсловияПеревозкиОписание.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.Перевозчик.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ДоставкаДоПеревозчика.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТочкаДоставкиПеревозчика.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ЗонаДоставкиПеревозчика.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТоварыСерия.Имя);
	
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.ТочкаДоставкиПолучателя.Имя);
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.ЗонаДоставки.Имя);
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.Перевозчик.Имя);
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.ТочкаДоставкиПеревозчика.Имя);
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.ЗонаДоставкиПеревозчика.Имя);
	
	Если Объект.СпособДоставки <> Перечисления.СпособыДоставки25.Самовывоз Тогда
		
		ИменаВидимыхЭлементов.Добавить(Элементы.ТочкаДоставкиОтправителя.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ЗонаОтправления.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТочкаДоставкиПолучателя.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ЗонаДоставки.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ВремяДоставкиС.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ВремяДоставкиПо.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ДополнительнаяИнформация.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ОсобыеУсловияПеревозки.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ОсобыеУсловияПеревозкиОписание.Имя);
		
	КонецЕсли;
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки25.НашимиСилами Тогда
		
		ИменаВидимыхЭлементов.Добавить(Элементы.ДоставкаДоПеревозчика.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.Перевозчик.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТочкаДоставкиПеревозчика.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ЗонаДоставкиПеревозчика.Имя);
		
		ИменаОбязательныхЭлементов.Добавить(Элементы.ТочкаДоставкиПолучателя.Имя);
		ИменаОбязательныхЭлементов.Добавить(Элементы.ЗонаДоставки.Имя);
		
		Если Объект.ДоставкаДоПеревозчика Тогда
			
			ИменаОбязательныхЭлементов.Добавить(Элементы.Перевозчик.Имя);
			ИменаОбязательныхЭлементов.Добавить(Элементы.ТочкаДоставкиПеревозчика.Имя);
			ИменаОбязательныхЭлементов.Добавить(Элементы.ЗонаДоставкиПеревозчика.Имя);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки25.СиламиПеревозчика Тогда
		
		ИменаВидимыхЭлементов.Добавить(Элементы.Перевозчик.Имя);
		
		ИменаОбязательныхЭлементов.Добавить(Элементы.Перевозчик.Имя);
		
	КонецЕсли;
	
	ДоступныДанныеПеревозчика =
		((Объект.СпособДоставки = Перечисления.СпособыДоставки25.НашимиСилами
		  И Объект.ДоставкаДоПеревозчика)
		 ИЛИ Объект.СпособДоставки = Перечисления.СпособыДоставки25.СиламиПеревозчика);
	
	Элементы.Перевозчик.ТолькоПросмотр = НЕ ДоступныДанныеПеревозчика;
	Элементы.ТочкаДоставкиПеревозчика.ТолькоПросмотр = НЕ ДоступныДанныеПеревозчика;
	Элементы.ЗонаДоставкиПеревозчика.ТолькоПросмотр = НЕ ДоступныДанныеПеревозчика;
	
	Элементы.ОсобыеУсловияПеревозкиОписание.ТолькоПросмотр = НЕ Объект.ОсобыеУсловияПеревозки;
	
	ПараметрыСерийСкладаОтправитель = СкладыСервер.ИспользованиеСерийНаСкладе(Объект.Отправитель, Ложь);
	Если ПараметрыСерийСкладаОтправитель.ИспользоватьСерииНоменклатуры Тогда
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыСерия.Имя);
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьВидимостьЭлементовПоМассиву(
		Элементы,
		ИменаВсехЭлементов,
		ИменаВидимыхЭлементов);
	
	ИменаНеОбязательныхЭлементов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ИменаЭлементовВозможнойОбязательности,
		ИменаОбязательныхЭлементов);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаНеОбязательныхЭлементов,
		"АвтоОтметкаНезаполненного",
		Ложь);
		
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаНеОбязательныхЭлементов,
		"ОтметкаНезаполненного",
		Ложь);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаОбязательныхЭлементов,
		"АвтоОтметкаНезаполненного",
		Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗонуДоставкиПоПеревозчику()
	
	Если Объект.ТочкаДоставкиПеревозчика.Пустая() Тогда
		
		Объект.ЗонаДоставкиПеревозчика = Справочники.ЗоныДоставки.ПустаяСсылка();
		
	Иначе
		
		РеквизитыТочкиДоставкиПеревозчика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Объект.ТочкаДоставкиПеревозчика, "ЗонаДоставки");
		Объект.ЗонаДоставкиПеревозчика = РеквизитыТочкиДоставкиПеревозчика.ЗонаДоставки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьВесОбъемВОбщихЕдиницах(СтрокаТоваров)
	
	// объем в кубических метрах
	Если СтрокаТоваров.МернаяЕдиница Тогда
		СтрокаТоваров.Объем = СтрокаТоваров.Количество * СтрокаТоваров.ОбъемЕдиницы;
	Иначе
		СтрокаТоваров.Объем = СтрокаТоваров.КоличествоУпаковок * СтрокаТоваров.ОбъемУпаковки;
	КонецЕсли;
	
	// вес нетто в кг
	СтрокаТоваров.ВесНетто = СтрокаТоваров.Количество * СтрокаТоваров.ВесНеттоЕдиницы;
	
	// вес брутто в кг
	Если СтрокаТоваров.МернаяЕдиница Тогда
		СтрокаТоваров.Вес = СтрокаТоваров.ВесНетто;
	Иначе
		СтрокаТоваров.Вес = СтрокаТоваров.КоличествоУпаковок * СтрокаТоваров.ВесУпаковки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КоэффициентыВесОбъем(Знач Номенклатура, Знач Упаковка)
	
	ПустаяУпаковка = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
	Результат = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентВесОбъемПрочиеРеквизитыУпаковки(ПустаяУпаковка, Номенклатура,, Ложь);
	МернаяЕдиница = Справочники.УпаковкиЕдиницыИзмерения.ЭтоМернаяЕдиница(Упаковка);
	Результат.Вставить("МернаяЕдиница", МернаяЕдиница);
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьВесНеттоЕдиницы(СтрокаТоваров)
	
	ДанныеНоменклатуры = КоэффициентыВесОбъем(СтрокаТоваров.Номенклатура, СтрокаТоваров.Упаковка);
	СтрокаТоваров.ВесНеттоЕдиницы = ДанныеНоменклатуры.ВесНетто; // Число
	СтрокаТоваров.ОбъемЕдиницы = ДанныеНоменклатуры.Объем; // Число
	СтрокаТоваров.МернаяЕдиница = ДанныеНоменклатуры.МернаяЕдиница;
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ПоказатьВопросОбОчисткеСпискаТоваров()
	
	ТекстВопроса = НСтр("ru = 'Список товаров будет очищен. Продолжить?'");
	Обещание = ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Возврат Обещание;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеОтправителя(Объект)
	
	ИменаПолей = "Отправитель, ТочкаДоставкиОтправителя, ЗонаОтправления";
	ТекущиеДанные = Новый Структура(ИменаПолей);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Объект);
	
	ДанныеОтправителя = Новый ФиксированнаяСтруктура(ТекущиеДанные);
	Возврат ДанныеОтправителя;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеПолучателя(Объект)
	
	ИменаПолей = "Получатель, ТочкаДоставкиПолучателя, ЗонаДоставки";
	ТекущиеДанные = Новый Структура(ИменаПолей);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Объект);
	
	ДанныеПолучателя = Новый ФиксированнаяСтруктура(ТекущиеДанные);
	Возврат ДанныеПолучателя;
	
КонецФункции

#Область ПодборДанных

&НаКлиенте
Процедура ПроверитьЗаполнениеПередПодбором(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ТекстОшибки = НСтр("ru = 'Поле ""Организация"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "Организация", "Объект", Отказ);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Отправитель) Тогда
		
		ТекстОшибки = НСтр("ru = 'Поле ""Отправитель"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "Отправитель", "Объект", Отказ);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Получатель) Тогда
		
		ТекстОшибки = НСтр("ru = 'Поле ""Получатель"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "Получатель", "Объект", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Функция РезультатЗаписиДокументаПередПодбором()
	
	РезультатЗаписи = Ложь;
	
	Если Объект.Проведен Тогда
		ТекстВопроса = НСтр("ru = 'Документ был изменен. Провести?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Документ был изменен. Записать?'");
	КонецЕсли;
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет); // КодВозвратаДиалога
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат РезультатЗаписи;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		
		ОчиститьСообщения();
		Если ПроверитьЗаполнение() Тогда
			РезультатЗаписи = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		КонецЕсли;
		
	Иначе
		
		РезультатЗаписи = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		
	КонецЕсли;
	
	Возврат РезультатЗаписи;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьПодборДанных()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Склад", Объект.Отправитель);
	ПараметрыФормы.Вставить("Получатель", Объект.Получатель);
	ПараметрыФормы.Вставить("УчитыватьКоличествоВДокументе", НЕ Объект.Проведен);
	ПараметрыФормы.Вставить("ДокументДоставки", Объект.Ссылка);
	
	Если Объект.НаправлениеДоставки = ПредопределенноеЗначение("Перечисление.НаправленияДоставки.СкладПартнер") Тогда
		ПараметрыФормы.Вставить("ТипДоставки", ПредопределенноеЗначение("Перечисление.ТипыДоставки.Исходящая"));
	КонецЕсли;
	
	Если Объект.ДоставкаДоПеревозчика Тогда
		
		ТочкаДоставкиФиксированная = Объект.ТочкаДоставкиПеревозчика;
		ЗонаДоставкиФиксированная = Объект.ЗонаДоставкиПеревозчика;
		
	Иначе
		
		ТочкаДоставкиФиксированная = Объект.ТочкаДоставкиПолучателя;
		ЗонаДоставкиФиксированная = Объект.ЗонаДоставки;
		
	КонецЕсли;
	ПараметрыФормы.Вставить("ТочкаДоставкиФиксированная", ТочкаДоставкиФиксированная);
	ПараметрыФормы.Вставить("ЗонаДоставкиФиксированная", ЗонаДоставкиФиксированная);
	ПараметрыФормы.Вставить("ЗафиксироватьПараметрыДоставки", Истина);
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументДоставки.Форма.ФормаПодбора",
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор);
	
КонецПроцедуры

// Параметры:
//  ВыбранноеЗначение - Структура:
//   * АдресПодобранныхТоваров - Строка
//
&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(Знач ВыбранноеЗначение)
	
	ПодобранныеТовары = ПодобранныеТовары(ВыбранноеЗначение);
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	НовыеСтрокиТоваров = Новый Массив; // Массив Из ДанныеФормыЭлементКоллекции
	
	ОтборТовары = Новый Структура;
	ОтборТовары.Вставить("Распоряжение", Неопределено);
	ОтборТовары.Вставить("КодСтрокиДоставки", 0);
	
	СтруктураДействияПересчитатьКоличествоУпаковок = Новый Структура("ПересчитатьКоличествоУпаковок", Неопределено);
	
	Для Каждого СтрокаПодобрано Из ПодобранныеТовары Цикл
		
		ЗаполнитьЗначенияСвойств(ОтборТовары, СтрокаПодобрано);
		ОтборТовары.КодСтрокиДоставки = СтрокаПодобрано.КодСтроки;
		СтрокиСодержимогоПоТовару = Объект.Товары.НайтиСтроки(ОтборТовары);
		Если СтрокиСодержимогоПоТовару.Количество() > 0 Тогда
			
			ПодходящаяСтрока = СтрокиСодержимогоПоТовару[0];
			ПодходящаяСтрока.Количество = ПодходящаяСтрока.Количество + СтрокаПодобрано.Количество;
			
			ЭтоНоваяСтрока = Ложь;
			
		Иначе
			
			ПодходящаяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(ПодходящаяСтрока, СтрокаПодобрано);
			ПодходящаяСтрока.КодСтрокиДоставки = СтрокаПодобрано.КодСтроки;
			НовыеСтрокиТоваров.Добавить(ПодходящаяСтрока);
			
			ЭтоНоваяСтрока = Истина;
			
		КонецЕсли;
		
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПересчитатьКоличествоУпаковокВСтрокеТЧ(
			ПодходящаяСтрока, СтруктураДействияПересчитатьКоличествоУпаковок, КэшированныеЗначения);
		
		Если НЕ ЭтоНоваяСтрока Тогда
			
			ПересчитатьВесОбъемВОбщихЕдиницах(ПодходящаяСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;
	ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", Неопределено);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", Неопределено);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Неопределено);
	ДобавитьДействияЗаполненияВесаОбъема(СтруктураДействий);
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Неопределено);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		НовыеСтрокиТоваров, СтруктураДействий, Объект.Товары, КэшированныеЗначения);
	
	Для Каждого СтрокаТоваров Из НовыеСтрокиТоваров Цикл
		
		ЗаполнитьВесНеттоЕдиницы(СтрокаТоваров);
		ПересчитатьВесОбъемВОбщихЕдиницах(СтрокаТоваров);
		
	КонецЦикла;
	
	Документы.ЗаказНаДоставку.ОбновитьДополнительныеПараметры(Объект, НовыеСтрокиТоваров);
	
КонецПроцедуры

// Параметры:
//  ВыбранноеЗначение - Структура - Выбранное значение:
// * АдресПодобранныхТоваров - Строка - 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица подобранных товаров:
//  * КодСтроки - Число
//  * ДоставкаДо - СправочникСсылка.Партнеры
//  * ТочкаДоставки - СправочникСсылка.ТочкиДоставки
//  * ЗонаДоставки - СправочникСсылка.ЗоныДоставки
//  * Количество - Число
//
&НаСервере
Функция ПодобранныеТовары(ВыбранноеЗначение)
	
	ПодобранныеТовары = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобранныхТоваров); // ТаблицаЗначений
	УдалитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобранныхТоваров);
	Возврат ПодобранныеТовары;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьКомандыПодбора()
	
	Элементы.ТоварыПодобратьДанные.Доступность = (НЕ ТолькоПросмотр);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормыВспомогательные

&НаСервере
Процедура СпособДоставкиПриИзмененииСервер()
	
	Если Объект.СпособДоставки <> Перечисления.СпособыДоставки25.НашимиСилами
	   И Объект.СпособДоставки <> Перечисления.СпособыДоставки25.СиламиПеревозчика Тогда
		
		Объект.ДоставкаДоПеревозчика = Ложь;
		Объект.Перевозчик = Справочники.Партнеры.ПустаяСсылка();
		Объект.ТочкаДоставкиПеревозчика = Справочники.ТочкиДоставки.ПустаяСсылка();
		Объект.ЗонаДоставкиПеревозчика = Справочники.ЗоныДоставки.ПустаяСсылка();
		
	КонецЕсли;
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки25.Самовывоз Тогда
		
		Объект.ТочкаДоставкиОтправителя = Справочники.ТочкиДоставки.ПустаяСсылка();
		Объект.ЗонаОтправления = Справочники.ЗоныДоставки.ПустаяСсылка();
		
		Объект.ТочкаДоставкиПолучателя = Справочники.ТочкиДоставки.ПустаяСсылка();
		Объект.ЗонаДоставки = Справочники.ЗоныДоставки.ПустаяСсылка();
		
		Объект.ВремяДоставкиС = Дата(1, 1, 1);
		Объект.ВремяДоставкиПо = Дата(1, 1, 1);
		
		Объект.ДополнительнаяИнформация = "";
		Объект.ОсобыеУсловияПеревозки = Ложь;
		Объект.ОсобыеУсловияПеревозкиОписание = "";
		
	КонецЕсли;
	
	НастроитьВидимостьДоступностьПолей();
	
КонецПроцедуры

&НаСервере
Процедура ОтправительПриИзмененииСервер()
	
	Если Объект.Отправитель = ТекущийОтправитель Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийОтправитель = Объект.Отправитель;
	ТекущиеДанныеОтправителя = ДанныеОтправителя(Объект);
	ДанныеТочкиОтправителя = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(Объект.Отправитель);
	Объект.ТочкаДоставкиОтправителя = ДанныеТочкиОтправителя.ТочкаДоставки;
	Объект.ЗонаОтправления = ДанныеТочкиОтправителя.ЗонаДоставки;
	
	НастроитьВидимостьДоступностьПолей();
	
КонецПроцедуры

&НаСервере
Процедура ПолучательПриИзмененииСервер()
	
	Если Объект.Получатель = ТекущийПолучатель Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПолучатель = Объект.Получатель;
	ТекущиеДанныеПолучателя = ДанныеПолучателя(Объект);
	ДанныеТочкиПолучателя = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(Объект.Получатель);
	Объект.ТочкаДоставкиПолучателя = ДанныеТочкиПолучателя.ТочкаДоставки;
	Объект.ЗонаДоставки = ДанныеТочкиПолучателя.ЗонаДоставки;
	
	НастроитьВидимостьДоступностьПолей();
	
КонецПроцедуры

&НаСервере
Процедура ПеревозчикПриИзмененииСервер()
	
	Если Объект.Перевозчик = ТекущийПеревозчик Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПеревозчик = Объект.Перевозчик;
	
	Если Объект.ДоставкаДоПеревозчика Тогда
		
		ДанныеТочкиПеревозчика = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(Объект.Перевозчик);
		Объект.ТочкаДоставкиПеревозчика = ДанныеТочкиПеревозчика.ТочкаДоставки;
		Объект.ЗонаДоставкиПеревозчика = ДанныеТочкиПеревозчика.ЗонаДоставки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТочкаДоставкиПолучателяПриИзмененииСервер()
	
	Если Объект.ТочкаДоставкиПолучателя.Пустая() Тогда
		
		Объект.ЗонаДоставки = Справочники.ЗоныДоставки.ПустаяСсылка();
		
	Иначе
		
		РеквизитыТочкиДоставкиПолучателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Объект.ТочкаДоставкиПолучателя, "ЗонаДоставки");
		Объект.ЗонаДоставки = РеквизитыТочкиДоставкиПолучателя.ЗонаДоставки;
		
	КонецЕсли;
	
	ТекущиеДанныеПолучателя = ДанныеПолучателя(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ТочкаДоставкиОтправителяПриИзмененииСервер()
	
	Если ЗначениеЗаполнено(Объект.ТочкаДоставкиОтправителя) Тогда
		
		РеквизитыТочкиОтправления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ТочкаДоставкиОтправителя, "ЗонаДоставки");
		Объект.ЗонаОтправления = РеквизитыТочкиОтправления.ЗонаДоставки;
		
	Иначе
		
		Объект.ЗонаОтправления = Справочники.ЗоныДоставки.ПустаяСсылка();
		
	КонецЕсли;
	
	ТекущиеДанныеОтправителя = ДанныеОтправителя(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокиТоваров(ИмяСобытия, Источник)
	
	ОтборСтрок = Новый Структура;
	
	Если ИмяСобытия = "Запись_Номенклатура" Тогда
		
		ОтборСтрок.Вставить("Номенклатура", Источник);
		
	ИначеЕсли ИмяСобытия = "Запись_УпаковкиНоменклатуры" Тогда
		
		ОтборСтрок.Вставить("Упаковка", Источник);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	СтрокиДляПересчета = Объект.Товары.НайтиСтроки(ОтборСтрок);
	Если СтрокиДляПересчета.Количество() > 0 Тогда
		
		ПересчитатьСтрокиТоваровСервер(ОтборСтрок);
		Модифицированность = Истина;
		
	КонецЕсли;
	
	РассчитатьИтогиВесОбъем();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокиТоваровСервер(Знач ОтборСтрок)
	
	СтрокиДляПересчета = Объект.Товары.НайтиСтроки(ОтборСтрок);
	
	СтруктураДействий = Новый Структура;
	
	Если ОтборСтрок.Свойство("Номенклатура") Тогда
		
		ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", Неопределено);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", Неопределено);
		
	КонецЕсли;
	
	ДобавитьДействияЗаполненияВесаОбъема(СтруктураДействий);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Неопределено);
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Неопределено);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(СтрокиДляПересчета, СтруктураДействий, Объект.Товары);
	
	Для Каждого СтрокаТоваров Из СтрокиДляПересчета Цикл
		
		ЗаполнитьВесНеттоЕдиницы(СтрокаТоваров);
		ПересчитатьВесОбъемВОбщихЕдиницах(СтрокаТоваров);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьДействияЗаполненияВесаОбъема(СтруктураДействий)
	
	СтруктураДействий.Вставить(
		"ЗаполнитьВесУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ВесУпаковки", Неопределено));
	СтруктураДействий.Вставить(
		"ЗаполнитьОбъемУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки", Неопределено));
	СтруктураДействий.Вставить(
		"ЗаполнитьЕдиницуИзмеренияВеса",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса", Неопределено));
	СтруктураДействий.Вставить(
		"ЗаполнитьЕдиницуИзмеренияОбъема",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема", Неопределено));
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогиВесОбъем()
	
	ОбновитьИтоги(Объект.Товары, ВесИтог, ВесНеттоИтог, ОбъемИтог);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоги(Товары, Вес, ВесНетто, Объем)
	
	Вес = Товары.Итог("Вес");
	ВесНетто = Товары.Итог("ВесНетто");
	Объем = Товары.Итог("Объем");
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы_Свойства

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СтандартныеПодсистемы_ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Параметры:
//  ПараметрыВыполнения - Структура -
//  ДополнительныеПараметры - Структура -
//
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
